<?php
    require_once dirname(__FILE__) . '/../Sancta/SanctaTestCase.php';
    require_once PATH_BASE . '/models/package/SmartFunction/SmartFunction.php';
    require_once PATH_LIBS . '/Mindfly/Date.php';

    class SmartFunctionTest extends SanctaTestCase {

        /**
         * @dataProvider providerFunction
         * @param <type> $strFormula
         * @param <type> $year
         * @param <type> $expected
         */
        public function testFunction($strFormula, $year, $expected) {
            $this->assertEquals($expected, SmartFunction::getDates($strFormula, $year));
        }
        
        public function providerFunction() {
            return array(
                // simple
                array('12.01', '', array(date('Y') . '-01-12')),
                array('[12.01]', '', array(date('Y') . '-01-12')),
                array('[28.03]', '', array(date('Y') . '-03-28')),
                array('[28.03.2010||]', '', array('2010-03-28')),
                array('[28.03]', '2010', array('2010-03-28')),
                array('[28.12.2010]', '', array('2010-12-28')),
                array('[28.12,29.12]', '', array(date('Y') . '-12-28', date('Y') . '-12-29')),                              
                array('[12.01]', '', array(date('Y') . '-01-12')),
                // посты
                array('28.11~06.01.+1','2010',  $this->getPeriond('2010-11-28','2011-01-06')), //Рождественский пост
                array('28.11~06.01.+1','2013',  $this->getPeriond('2013-11-28','2014-01-06')), //Рождественский пост
                array('14.08~27.08','2010',  $this->getPeriond('2010-08-14','2010-08-27')), //  Успенский пост
                array('14.08~27.08','2011',  $this->getPeriond('2011-08-14','2011-08-27')), //  Успенский пост
                array('57>{Pascha}~11.07', '2010', $this->getPeriond('2010-05-31','2010-07-11')), //Петров пост
                array('57>{Pascha}~11.07', '2011', $this->getPeriond('2011-06-20','2011-07-11')), //Петров пост
                array('48<{Pascha}~1<{Pascha}', '2011', $this->getPeriond('2011-03-07','2011-04-23')), // Великий пост
                array('48<{Pascha}~1<{Pascha}', '2012', $this->getPeriond('2012-02-27','2012-04-14')), // Великий пост
                // мясоеды
                array('28.08~27.11','2010', $this->getPeriond('2010-08-28','2010-11-27')), //Осенний мясоед
                array('28.08~27.11','2011', $this->getPeriond('2011-08-28','2011-11-27')), //Осенний мясоед
                array('28.08~27.11','2013', $this->getPeriond('2013-08-28','2013-11-27')), //Осенний мясоед
                array('07.01~49<{Pascha}', '2010', $this->getPeriond('2010-01-07','2010-02-14')), // зимний мясоед
                array('07.01~49<{Pascha}', '2011', $this->getPeriond('2011-01-07','2011-03-06')), // зимний мясоед
                array('07.01~49<{Pascha}', '2012', $this->getPeriond('2012-01-07','2012-02-26')), // зимний мясоед
                array('{Pascha}~56>{Pascha}', '2010', $this->getPeriond('2010-04-04','2010-05-30')), // Весенний мясоед
                array('{Pascha}~56>{Pascha}', '2011', $this->getPeriond('2011-04-24','2011-06-19')), // Весенний мясоед
                array('{Pascha}~56>{Pascha}', '2012', $this->getPeriond('2012-04-15','2012-06-10')), // Весенний мясоед
                array('12.07~13.08', '2010', $this->getPeriond('2010-07-12','2010-08-13')), // Летний мясоед
                array('12.07~13.08', '2011', $this->getPeriond('2011-07-12','2011-08-13')), // Летний мясоед
                array('12.07~13.08', '2012', $this->getPeriond('2012-07-12','2012-08-13')), // Летний мясоед
                // сплошные седмицы
                array('07.01~18.01', '2011', $this->getPeriond('2011-01-07', '2011-01-18')), // Святки
                array('07.01~18.01', '2012', $this->getPeriond('2012-01-07', '2012-01-18')), // Святки
                array('07.01~18.01', '2013', $this->getPeriond('2013-01-07', '2013-01-18')), // Святки
                array('69<{Pascha}~63<{Pascha}', '2011', $this->getPeriond('2011-02-14', '2011-02-20')), // седмица Мытаря и фарисея
                array('69<{Pascha}~63<{Pascha}', '2012', $this->getPeriond('2012-02-06', '2012-02-12')), // седмица Мытаря и фарисея
                array('69<{Pascha}~63<{Pascha}', '2013', $this->getPeriond('2013-02-25', '2013-03-03')), // седмица Мытаря и фарисея
                array('55<{Pascha}~49<{Pascha}', '2011', $this->getPeriond('2011-02-28', '2011-03-06')), // масленица
                array('55<{Pascha}~49<{Pascha}', '2012', $this->getPeriond('2012-02-20', '2012-02-26')), // масленица
                array('55<{Pascha}~49<{Pascha}', '2013', $this->getPeriond('2013-03-11', '2013-03-17')), // масленица
                array('{Pascha}~6>{Pascha}', '2011', $this->getPeriond('2011-04-24', '2011-04-30')), // Пасхальная седмица
                array('{Pascha}~6>{Pascha}', '2012', $this->getPeriond('2012-04-15', '2012-04-21')), // Пасхальная седмица
                array('{Pascha}~6>{Pascha}', '2013', $this->getPeriond('2013-05-05', '2013-05-11')), // Пасхальная седмица
                array('50>{Pascha}~56>{Pascha}', '2011', $this->getPeriond('2011-06-13', '2011-06-19')), // Троицкая седмица
                array('50>{Pascha}~56>{Pascha}', '2012', $this->getPeriond('2012-06-04', '2012-06-10')), // Троицкая седмица
                array('50>{Pascha}~56>{Pascha}', '2013', $this->getPeriond('2013-06-24', '2013-06-30')), // Троицкая седмица
                array('62<{Pascha}~56<{Pascha}', '2011', $this->getPeriond('2011-02-21', '2011-02-27')), // мясопустная седмица
                array('62<{Pascha}~56<{Pascha}', '2012', $this->getPeriond('2012-02-13', '2012-02-19')), // мясопустная седмица
                array('62<{Pascha}~56<{Pascha}', '2013', $this->getPeriond('2013-03-04', '2013-03-10')), // мясопустная седмица
                array('6<{Pascha}~1<{Pascha}', '2011', $this->getPeriond('2011-04-18', '2011-04-23')), // Страстная седмица
                array('6<{Pascha}~1<{Pascha}', '2012', $this->getPeriond('2012-04-09', '2012-04-14')), // Страстная седмица
                array('6<{Pascha}~1<{Pascha}', '2013', $this->getPeriond('2013-04-29', '2013-05-04')), // Страстная седмица
                // Страстная седмица
                array('6<{Pascha}', '2011', array('2011-04-18')), // Страстной понедельик
                array('5<{Pascha}', '2011', array('2011-04-19')), // Страстной вторник
                array('4<{Pascha}', '2011', array('2011-04-20')), // Страстной среда
                array('3<{Pascha}', '2011', array('2011-04-21')), // Страстной четверг
                array('2<{Pascha}', '2011', array('2011-04-22')), // Страстная пятница
                array('1<{Pascha}', '2011', array('2011-04-23')), // Страстная суббота
                // Великие праздники
                array('{Pascha}', '2010', array('2010-04-04')), // пасха
                array('{Pascha}', '2011', array('2011-04-24')), // пасха
                array('{Pascha}', '2012', array('2012-04-15')), // пасха
                array('{Pascha}', '2013', array('2013-05-05')), // пасха
                array('{Pascha}', '2014', array('2014-04-20')), // пасха
                array('{Pascha}', '2015', array('2015-04-12')), // пасха
                array('{Pascha}', '2016', array('2016-05-01')), // пасха
                array('{Pascha}', '2017', array('2017-04-16')), // пасха
                array('{Pascha}', '2018', array('2018-04-08')), // пасха
                array('{Pascha}', '2019', array('2019-04-28')), // пасха
                array('{Pascha}', '2020', array('2020-04-19')), // пасха
                array('21.09', '2010', array('2010-09-21')), //  Рождество Богородицы
                array('21.09', '2011', array('2011-09-21')), //  Рождество Богородицы
                array('21.09', '2012', array('2012-09-21')), //  Рождество Богородицы
                array('27.09', '2010', array('2010-09-27')), //  Водвижение креста господня
                array('27.09', '2011', array('2011-09-27')), //  Водвижение креста господня
                array('27.09', '2012', array('2012-09-27')), //  Водвижение креста господня
                array('04.12', '2010', array('2010-12-04')), //  Введение во храм Пресвятой Богородицы
                array('04.12', '2011', array('2011-12-04')), //  Введение во храм Пресвятой Богородицы
                array('04.12', '2012', array('2012-12-04')), //  Введение во храм Пресвятой Богородицы
                array('07.01', '2010', array('2010-01-07')), //  Рождество христово
                array('07.01', '2011', array('2011-01-07')), //  Рождество христово
                array('07.01', '2012', array('2012-01-07')), //  Рождество христово
                array('19.01', '2010', array('2010-01-19')), //  Крещение Господне
                array('19.01', '2011', array('2011-01-19')), //  Крещение Господне
                array('19.01', '2012', array('2012-01-19')), //  Крещение Господне
                array('15.02', '2010', array('2010-02-15')), //  Сретение Господне
                array('15.02', '2011', array('2011-02-15')), //  Сретение Господне
                array('15.02', '2012', array('2012-02-15')), //  Сретение Господне
                array('07.04', '2010', array('2010-04-07')), //  Благовещение Пресвятой Богородицы
                array('07.04', '2011', array('2011-04-07')), //  Благовещение Пресвятой Богородицы
                array('07.04', '2012', array('2012-04-07')), //  Благовещение Пресвятой Богородицы
                array('7<{Pascha}', '2010', array('2010-03-28')), //  Вход Господень в Иерусалим
                array('7<{Pascha}', '2011', array('2011-04-17')), //  Вход Господень в Иерусалим
                array('7<{Pascha}', '2012', array('2012-04-08')), //  Вход Господень в Иерусалим
                array('7<{Pascha}', '2013', array('2013-04-28')), //  Вход Господень в Иерусалим
                array('7<{Pascha}', '2014', array('2014-04-13')), //  Вход Господень в Иерусалим
                array('7<{Pascha}', '2015', array('2015-04-05')), //  Вход Господень в Иерусалим
                array('39>{Pascha}', '2010', array('2010-05-13')), //  Вознесение Господне
                array('39>{Pascha}', '2011', array('2011-06-02')), //  Вознесение Господне
                array('39>{Pascha}', '2012', array('2012-05-24')), //  Вознесение Господне
                array('39>{Pascha}', '2013', array('2013-06-13')), //  Вознесение Господне
                array('39>{Pascha}', '2014', array('2014-05-29')), //  Вознесение Господне
                array('39>{Pascha}', '2015', array('2015-05-21')), //  Вознесение Господне
                array('49>{Pascha}', '2010', array('2010-05-23')), //  День святой троицы
                array('49>{Pascha}', '2011', array('2011-06-12')), //  День святой троицы
                array('49>{Pascha}', '2012', array('2012-06-03')), //  День святой троицы
                array('49>{Pascha}', '2013', array('2013-06-23')), //  День святой троицы
                array('49>{Pascha}', '2014', array('2014-06-08')), //  День святой троицы
                array('49>{Pascha}', '2015', array('2015-05-31')), //  День святой троицы
                array('19.08', '2010', array('2010-08-19')), //  Преображение Господне
                array('19.08', '2011', array('2011-08-19')), //  Преображение Господне
                array('19.08', '2012', array('2012-08-19')), //  Преображение Господне
                array('28.08', '2010', array('2010-08-28')), //  Успение Пресвятой Богородицы
                array('28.08', '2011', array('2011-08-28')), //  Успение Пресвятой Богородицы
                array('28.08', '2012', array('2012-08-28')), //  Успение Пресвятой Богородицы
                array('14.10', '2010', array('2010-10-14')), //  Покров Пресвятой Богородицы
                array('14.10', '2011', array('2011-10-14')), //  Покров Пресвятой Богородицы
                array('14.10', '2012', array('2012-10-14')), //  Покров Пресвятой Богородицы
                array('14.01', '2010', array('2010-01-14')), //  Обрезание Господне
                array('14.01', '2011', array('2011-01-14')), //  Обрезание Господне
                array('14.01', '2012', array('2012-01-14')), //  Обрезание Господне
                array('07.07', '2010', array('2010-07-07')), //  Рождество Иоанна Предтечи
                array('07.07', '2011', array('2011-07-07')), //  Рождество Иоанна Предтечи
                array('07.07', '2012', array('2012-07-07')), //  Рождество Иоанна Предтечи
                array('12.07', '2010', array('2010-07-12')), //  День апостолов петра и павла
                array('12.07', '2011', array('2011-07-12')), //  День апостолов петра и павла
                array('12.07', '2012', array('2012-07-12')), //  День апостолов петра и павла
                array('11.09', '2010', array('2010-09-11')), //  Усекновение главы иона Предтечи
                array('11.09', '2011', array('2011-09-11')), //  Усекновение главы иона Предтечи
                array('11.09', '2012', array('2012-09-11')), //  Усекновение главы иона Предтечи
                
                array('06.01', '2011', array('2011-01-06')), //  Рождественский сочельник
                array('06.01', '2012', array('2012-01-06')), //  Рождественский сочельник

                array('18.01', '2011', array('2011-01-18')), //  Богоявленский сочельник
                array('18.01', '2012', array('2012-01-18')), //  Богоявленский сочельник

                // дни особого поминовения усопших
                array('57<{Pascha}', '2010', array('2010-02-06')), //  Мясопустная вселенская родительская суббота
                array('57<{Pascha}', '2011', array('2011-02-26')), //  Мясопустная вселенская родительская суббота
                array('57<{Pascha}', '2012', array('2012-02-18')), //  Мясопустная вселенская родительская суббота
                array('36<{Pascha},29<{Pascha},22<{Pascha}', '2010', array('2010-02-27', '2010-03-06', '2010-03-13')), //  Родительская вселенская суббота
                array('36<{Pascha},29<{Pascha},22<{Pascha}', '2011', array('2011-03-19', '2011-03-26', '2011-04-02')), //  Родительская вселенская суббота
                array('36<{Pascha},29<{Pascha},22<{Pascha}', '2012', array('2012-03-10', '2012-03-17', '2012-03-24')), //  Родительская вселенская суббота
                array('9>{Pascha}', '2010', array('2010-04-13')), //  Радоница
                array('9>{Pascha}', '2011', array('2011-05-03')), //  Радоница
                array('9>{Pascha}', '2012', array('2012-04-24')), //  Радоница
                array('09.05', '2010', array('2010-05-09')), //  9-го мая
                array('09.05', '2011', array('2011-05-09')), //  9-го мая
                array('09.05', '2012', array('2012-05-09')), //  9-го мая
                array('48>{Pascha}', '2010', array('2010-05-22')), //  Троицкая вселенская родительская суббота
                array('48>{Pascha}', '2011', array('2011-06-11')), //  Троицкая вселенская родительская суббота
                array('48>{Pascha}', '2012', array('2012-06-02')), //  Троицкая вселенская родительская суббота
                array('02.11~08.11|0000010', '2010', array('2010-11-06')), //  Димитриевская суббота
                array('02.11~08.11|0000010', '2011', array('2011-11-05')), //  Димитриевская суббота
                array('02.11~08.11|0000010', '2012', array('2012-11-03')), //  Димитриевская суббота
                // дни четырдесятницы
                array('70<{Pascha}', '2011', array('2011-02-13')), // Неделя мытаря и фарисея.
                array('70<{Pascha}', '2012', array('2012-02-05')), // Неделя мытаря и фарисея.
                array('70<{Pascha}', '2013', array('2013-02-24')), // Неделя мытаря и фарисея.

                array('63<{Pascha}', '2011', array('2011-02-20')), // Неделя о блудном сыне
                array('63<{Pascha}', '2012', array('2012-02-12')), // Неделя о блудном сыне
                array('63<{Pascha}', '2013', array('2013-03-03')), // Неделя о блудном сыне

                array('56<{Pascha}', '2011', array('2011-02-27')), // Неделя о Страшном суде. Заговенье на мясо
                array('56<{Pascha}', '2012', array('2012-02-19')), // Неделя о Страшном суде. Заговенье на мясо
                array('56<{Pascha}', '2013', array('2013-03-10')), // Неделя о Страшном суде. Заговенье на мясо

                array('49<{Pascha}', '2011', array('2011-03-06')), // Прощеное воскресенье - Неделя сыропустная
                array('49<{Pascha}', '2012', array('2012-02-26')), // Прощеное воскресенье - Неделя сыропустная
                array('49<{Pascha}', '2013', array('2013-03-17')), // Прощеное воскресенье - Неделя сыропустная
                
                array('42<{Pascha}', '2011', array('2011-03-13')), // тожество православия
                array('42<{Pascha}', '2012', array('2012-03-04')), // тожество православия
                array('42<{Pascha}', '2013', array('2013-03-24')), // тожество православия

                array('35<{Pascha}', '2011', array('2011-03-20')), // Неделя 2-я Великого поста - Святителя Григория Паламы
                array('35<{Pascha}', '2012', array('2012-03-11')), // Неделя 2-я Великого поста - Святителя Григория Паламы
                array('35<{Pascha}', '2013', array('2013-03-31')), // Неделя 2-я Великого поста - Святителя Григория Паламы

                array('28<{Pascha}', '2011', array('2011-03-27')), // Неделя 3-я Великого поста - Крестопоклонная
                array('28<{Pascha}', '2012', array('2012-03-18')), // Неделя 3-я Великого поста - Крестопоклонная
                array('28<{Pascha}', '2013', array('2013-04-07')), // Неделя 3-я Великого поста - Крестопоклонная

                array('21<{Pascha}', '2011', array('2011-04-03')), // Преподобного Иоанна Лествичника
                array('21<{Pascha}', '2012', array('2012-03-25')), // Преподобного Иоанна Лествичника
                array('21<{Pascha}', '2013', array('2013-04-14')), // Преподобного Иоанна Лествичника

                array('14<{Pascha}', '2011', array('2011-04-10')), // Преподобной Марии Египетской
                array('14<{Pascha}', '2012', array('2012-04-01')), // Преподобной Марии Египетской
                array('14<{Pascha}', '2013', array('2013-04-21')), // Преподобной Марии Египетской

                array('15<{Pascha}', '2011', array('2011-04-09')), // Суббота акафиста
                array('15<{Pascha}', '2012', array('2012-03-31')), // Суббота акафиста
                array('15<{Pascha}', '2013', array('2013-04-20')), // Суббота акафиста

                array('17<{Pascha}', '2011', array('2011-04-07')), // Марьино стояние
                array('17<{Pascha}', '2012', array('2012-03-29')), // Марьино стояние
                array('17<{Pascha}', '2013', array('2013-04-18')), // Марьино стояние

                array('8<{Pascha}', '2011', array('2011-04-16')), // Лазарева суббота
                array('8<{Pascha}', '2012', array('2012-04-07')), // Лазарева суббота
                array('8<{Pascha}', '2013', array('2013-04-27')), // Лазарева суббота
                array('01.05~31.05|0000001|-1', '2011', array('2011-05-29')), // последнее воскресенье мая
                array('01.05~31.05|0000001|-1', '2012', array('2012-05-27')), // последнее воскресенье мая
                array('01.10~31.10|0000001|-1', '2011', array('2011-10-30')), // последнее воскресенье октября
                array('01.10~31.10|0000001|-1', '2012', array('2012-10-28')), // последнее воскресенье октября
                array('[01.05~31.05|0000001|-1]~[01.10~31.10|0000001|-1]','2011', $this->getPeriond('2011-05-29','2011-10-30')),
            );
        }


        private function getPeriond($from, $to) {
            $date = new Mindfly_Date($from);
            $excepted = array();
            do {
                $excepted[] = $date->getDay();
                $date->nextDay();
            } while ($date->getDay() <= $to);
            return $excepted;
        }


        public function providerToString() {
            return array(
                array('15.02~20.02','2010','с 15 по 20 февраля'),
                array('01.03~31.03','2010','с 1 по 31 марта'),
                array('13.03~12.04','2010','с 13 марта по 12 апреля'),
                array('15.02','2010','15 февраля'),
                array('03.02','2010','3 февраля'),
                array('11.04~17.04|0101010','2011','12, 14, 16 апреля'),
                array('25.04~06.05|0101010','2011','26, 28, 30 апреля, 3, 5 мая'),
            );
        }

        /**
         * @dataProvider providerToString
         * 
         * @param <type> $strFormula
         * @param <type> $year
         * @param <type> $expected
         */
        public function testToString($formula, $year, $result) {
            $this->assertEquals($result, SmartFunction::toString(
                                           SmartFunction::getDates($formula, $year)
                                         )
            );
        }

    }